0/Gamma_latent
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    //location    "0";  // as T for step1, time 0, Umax=4.25m/s
    object      Gamma_latent;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottomSample
    {
        type            zeroGradient;
    }

    leftAndRightSample
    {
        type            zeroGradient;
    }

    backSample
    {
        type            zeroGradient;
    }

    topAtmosphere
    {
        type            zeroGradient;
    }

    leftAndRightAtmosphere
    {
        type            zeroGradient;
    }
    backAtmosphere
    {
        type            zeroGradient;
    }
    symmetryBc
    {
        type            symmetryPlane;
    }
}

/*
-------------------------------------------------------------------------------------------------------------------------
// ************************************************************************* //
