0/rho.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0];

internalField   uniform 1.664;

boundaryField
{
    bottomSample
    {
        type fixedValue;
        value uniform 7950;
    }

    leftAndRightSample
    {
        type fixedValue;
        value uniform 7950;
    }

    backSample
    {
        type fixedValue;
        value uniform 7950;
    }
    
    topAtmosphere
    {
        type fixedValue;
        value uniform 1.664;
    }

    leftAndRightAtmosphere
    {
        type fixedValue;
        value uniform 1.664;
    }

    backAtmosphere
    {
        type fixedValue;
        value uniform 1.664;
    }
    
    symmetryBc
    {
        type            symmetryPlane;
    }

}

// ************************************************************************* //
